Repository: jeremypw/bulk-renamer
Catalog: po/extra/*.po
Languages: fr

source: Rename multiple files according to one or more rules
fr: Renommez plusieurs fichiers selon une ou plusieurs règles

source: Rename multiple files by applying on or more rules to the original name or to a new basename
fr: Renommez plusieurs fichiers en appliquant une ou plusieurs règles au nom d'origine ou à un nouveau nom de base

source: Add an index number with a chosen starting point and digits as a prefix or suffix
fr: Ajouter un numéro d'index avec un point de départ choisi et des chiffres comme préfixe ou suffixe

source: Add a date (current, creation or modification) as a prefix or suffix
fr: Ajouter une date (actuelle, de création ou de modification) comme préfixe ou suffixe

source: Add or replace text
fr: Ajouter ou remplacer du texte

source: A chosen separator may be inserted together with the new text
fr: Un séparateur choisi peut être inséré avec le nouveau texte

source: Fix validation of desktop and appdata files
fr: Correction de la validation des fichiers de bureau et de données d'application

source: Initial release
fr: Première version

source: Use original name or a new constant name as a basis for renaming
fr: Utilisez le nom d'origine ou un nouveau nom de constante comme base pour renommer

source: Add a number sequence, date or text before or after the basename
fr: Ajouter une séquence de nombres, une date ou un texte avant ou après le nom de base

source: Choose an arbitrary separator for new text
fr: Choisissez un séparateur arbitraire pour le nouveau texte

source: Replace a specified part of the name with other text
fr: Remplacer une partie spécifiée du nom par un autre texte

source: Apply several rules in sequence
fr: Appliquer plusieurs règles en séquence

source: See the results before renaming
fr: Voir les résultats avant de renommer

source: Undo the last rename operation while window is open
fr: Annuler la dernière opération de changement de nom pendant que la fenêtre est ouverte

source: Main Window
fr: Fenêtre principale
